examples/01_LIGGGHTSVerificationTests/i_normalForceTest/openHFDIB-DEM/RestituionCoeff-0.06/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (-1.5 -3.5 -1.5) //0
    (1.5 -3.5 -1.5) //1
    (1.5 3.5 -1.5) //2
    (-1.5 3.5 -1.5) //3
    (-1.5 -3.5 1.5) //4
    (1.5 -3.5 1.5) //5
    (1.5 3.5 1.5) //6
    (-1.5 3.5 1.5) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (15 35 15) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
			(0 4 7 3)	
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
            
        );
    }
    outlet
    {
        type wall;
        faces
        (
          (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
