examples/01_LIGGGHTSVerificationTests/i_normalForceTest/openHFDIB-DEM/RestituionCoeff-0.06/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel  Newtonian;

nu             nu   [0 2 -1 0 0 0 0] 7e-6;
rho            rho  [1 -3 0 0 0 0 0] 1141;
//~ nu             nu   [0 2 -1 0 0 0 0] 0.001;
//~ rho            rho  [1 -3 0 0 0 0 0] 5;


// ************************************************************************* //
